DataProcessors/ТаблицаXML_ПланПоЦелевомуТрафику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>ТаблицаXML_ПланПоЦелевомуТрафику</Name>
			<Comment>Используется для ввода плана по целевому трафику в учетную политику в параметр "РостовВиктор_ПланПоЦелевомуТрафику", который используется в отчете выполнение плана по целевому трафику</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаЦелевая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ТаблицаXML_ПланПоЦелевомуТрафику/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.РегистрСведений) Тогда
		ЭтаФорма.Объект.РегистрСведений = ЭтаФорма.Параметры.РегистрСведений;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Измерение) Тогда
		ЭтаФорма.Объект.Измерение = ЭтаФорма.Параметры.Измерение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Ресурс) Тогда
		ЭтаФорма.Объект.Ресурс = ЭтаФорма.Параметры.Ресурс;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.ЗначениеИзмерения) Тогда
		ЭтаФорма.Объект.ЗначениеИзмерения = ЭтаФорма.Параметры.ЗначениеИзмерения;
		
		//Если при вызове формы параметры заполнены, значит она вызвана не напрямую,
		// т.е. не предполагает изменение этих настроек, поэтому скроем все закладки, кроме "СтрДанные"
		
		ЭтаФорма.Элементы.СтрПараметрыТаблицы.Видимость = Ложь;
		ЭтаФорма.Элементы.СтрОтладкаСкрыть.Видимость	=Ложь;
	КонецЕсли;
	
	//Установи настройки по умолчанию
	//------------------------------------
	Об = РеквизитФормыВЗначение("Объект");                        
	Об.УстановитьНастройки();
	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура СформируйСписокВыбора(ИмяОбъектаМетаданных)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ Т.Ссылка КАК Ссылка, ПРЕДСТАВЛЕНИЕ(Т.Ссылка) КАК Представление ИЗ Справочник.ТочкиЦелевые КАК Т ГДЕ Т.ПометкаУдаления = ЛОЖЬ";	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ТочкиЦелевые", ИмяОбъектаМетаданных);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.Элементы.ТЗКолонка2.СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Команда2_НаСервере(); 
КонецПроцедуры

&НаСервере
Процедура Команда1_НаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Сериализовать();
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1_НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда2_НаСервере()  
	Об = РеквизитФормыВЗначение("Объект");
	Об.Десериализовать();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	Команда2_НаСервере()
КонецПроцедуры
